In [884]:
import pandas as pd
import numpy as np

In [885]:
pd.__version__

'1.5.3'

In [886]:
None,np.nan # np.nan - jest zmiennoprzecinkowa

(None, nan)

In [887]:
s = pd.Series([1,3,4,np.nan,6,8]) #lista
s

0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [888]:
type(s)

pandas.core.series.Series

In [889]:
dates = pd.date_range('20130101', periods =6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [890]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [891]:
df = pd.DataFrame({'A':[1,2,3],
                  'B':[4,5,6]})
df

   A  B
0  1  4
1  2  5
2  3  6

In [892]:
type(df)

pandas.core.frame.DataFrame

In [1004]:
df = pd.DataFrame(np.random.randn(6,4),
                 index=dates,
                 columns =list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.138523  1.600831 -0.381396 -0.870288
2013-01-02 -0.943070  1.129623  0.388183 -0.129496
2013-01-03  0.584067  0.839937  1.079743 -0.507180
2013-01-04  0.768748 -0.397620 -1.335075 -0.439327
2013-01-05  0.722050  1.816211 -0.114543  0.303066
2013-01-06  1.125701  1.138635 -1.710956 -0.491032

In [1005]:
np.random.randn(6,4)

array([[ 1.27593705, -0.18505654,  0.75110547,  0.072324  ],
       [ 0.47426504,  0.93725441,  0.83597157, -0.51281431],
       [-1.92969124, -1.54777041, -0.15254914,  0.67815063],
       [ 0.50036333, -1.12215301, -0.13535469,  0.81093079],
       [-0.8607866 , -1.24990074, -0.70270291,  0.79935478],
       [-0.79638924,  0.08765977,  0.46690686, -1.57403052]])

In [1006]:
type(np.random.randn(6,4))

numpy.ndarray

In [1007]:
df2 = pd.DataFrame({
                    'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo',
                    'G' : [False, True,True,False]
                   })
df2

     A          B    C  D      E    F      G
0  1.0 2013-01-02  1.0  3   test  foo  False
1  1.0 2013-01-02  1.0  3  train  foo   True
2  1.0 2013-01-02  1.0  3   test  foo   True
3  1.0 2013-01-02  1.0  3  train  foo  False

In [1008]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
 6   G       4 non-null      bool
dtypes: bool(1), category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 292.0+ bytes

In [1009]:
type(pd.Timestamp('20130102'))

pandas._libs.tslibs.timestamps.Timestamp

In [1010]:
df2['B'].values[0] # wartość kolumny B, wiersza 0

numpy.datetime64('2013-01-02T00:00:00.000000000')

In [1011]:
type([False, True,True,False])

list

In [1012]:
df2['G'].values[0] # wartość kolumny G, wiersza 0

False

In [1013]:
df = pd.DataFrame({'A':[1,'2',3],
                  'B':[4,5,6]})
df

   A  B
0  1  4
1  2  5
2  3  6

In [1014]:
df.info() # type object utożsamiamy ze stringiem, pod stringiem może być wszystko

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      object
 1   B       3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [1015]:
#df['A'].sum() # nie może policzyć, bo 2 jest stringiem/obiektem a nie int/float

In [1016]:
dane_sprzedaz_df = pd.read_csv('dane_sprzedaz.csv', sep=',', encoding='utf-8')
dane_sprzedaz_df

     DZIEN_DATA  SKL_ID  TOW_ID  SPRZ_NETTO  ZYSK_PROCENT ZYSK_WART
0    01.05.2022       1       1       416.0             9     37,44
1    02.05.2022       1       1       454.0             2      9,08
2    03.05.2022       1       1       392.0            13     50,96
3    04.05.2022       1       1       498.0             9     44,82
4    05.05.2022       1       1       341.0            15     51,15
..          ...     ...     ...         ...           ...       ...
130  11.05.2022       3       3       374.0             7     26,18
131  12.05.2022       3       3       390.0             4      15,6
132  13.05.2022       3       3       485.0            10      48,5
133  14.05.2022       3       3       479.0             3     14,37
134  15.05.2022       3       3       366.0            13     47,58

[135 rows x 6 columns]

In [1017]:
df = pd.DataFrame(np.random.randn(6,4),
                 index=dates,
                 columns =list('ABCD'))
df

                   A         B         C         D
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-05  0.315610  0.696807  0.586792  1.253378
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1018]:
df.head(3)

                   A         B         C         D
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544

In [1019]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-05  0.315610  0.696807  0.586792  1.253378
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1020]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [1021]:
df.values

array([[ 2.6869802 ,  0.62065834,  0.56608024, -0.79642141],
       [ 1.78126826, -1.60325063, -0.38767337, -1.44638453],
       [-0.01927998,  0.47680678,  1.04577172,  0.29154394],
       [-0.23135192, -0.20152045,  0.72095868,  0.91607626],
       [ 0.31561018,  0.69680682,  0.58679199,  1.25337765],
       [-0.36790296, -0.29492397, -0.23736129, -0.15868498]])

In [1022]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [1023]:
# z macierza
my_array = np.array([[11,22,33],[44,55,66]])

df_numpy = pd.DataFrame(my_array, columns = ['Column_A','Column_B','Column_C'])

print(df_numpy)
print(type(df_numpy))

   Column_A  Column_B  Column_C
0        11        22        33
1        44        55        66
<class 'pandas.core.frame.DataFrame'>

In [1024]:
# ze słownika
data = {
        'col_1': [3, 2, 1, 0], 
        'col_2': ['a', 'b', 'c', 'd']
        }
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [1025]:
df

                   A         B         C         D
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-05  0.315610  0.696807  0.586792  1.253378
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1026]:
df.shape # wierszy, column

(6, 4)

In [1027]:
df.size

24

In [1028]:
len(df) # do pętli

6

In [1029]:
df.sample(2) # do testów, wybieramy ilość wierszy

                   A         B         C         D
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-05  0.315610  0.696807  0.586792  1.253378

In [1030]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [1031]:
type(df)

pandas.core.frame.DataFrame

In [1032]:
df.A # pokaz nam kolumne A

2013-01-01    2.686980
2013-01-02    1.781268
2013-01-03   -0.019280
2013-01-04   -0.231352
2013-01-05    0.315610
2013-01-06   -0.367903
Freq: D, Name: A, dtype: float64

In [1033]:
type(df.A) # type tylko kolumny A

pandas.core.series.Series

In [1034]:
# transpozyvja, zamina kolumn z wierszami
# piwoty, czesciowa zamiana kolumn z wierszami
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    2.686980    1.781268   -0.019280   -0.231352    0.315610   -0.367903
B    0.620658   -1.603251    0.476807   -0.201520    0.696807   -0.294924
C    0.566080   -0.387673    1.045772    0.720959    0.586792   -0.237361
D   -0.796421   -1.446385    0.291544    0.916076    1.253378   -0.158685

In [1035]:
df2 = df.sample(2)

In [1036]:
df2

                   A         B         C         D
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385

In [1037]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-05  0.315610  0.696807  0.586792  1.253378
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-03 -0.019280  0.476807  1.045772  0.291544
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385

In [1038]:
df.reset_index() # bez przypisania df sie nie zmienia

       index         A         B         C         D
0 2013-01-01  2.686980  0.620658  0.566080 -0.796421
1 2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2 2013-01-03 -0.019280  0.476807  1.045772  0.291544
3 2013-01-04 -0.231352 -0.201520  0.720959  0.916076
4 2013-01-05  0.315610  0.696807  0.586792  1.253378
5 2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1039]:
df.reset_index(drop=True) #resetuj indeks i wyrzuc go

          A         B         C         D
0  2.686980  0.620658  0.566080 -0.796421
1  1.781268 -1.603251 -0.387673 -1.446385
2 -0.019280  0.476807  1.045772  0.291544
3 -0.231352 -0.201520  0.720959  0.916076
4  0.315610  0.696807  0.586792  1.253378
5 -0.367903 -0.294924 -0.237361 -0.158685

In [1040]:
df.reset_index(drop=False) #resetuj indeks i nie wyrzucaj go

       index         A         B         C         D
0 2013-01-01  2.686980  0.620658  0.566080 -0.796421
1 2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2 2013-01-03 -0.019280  0.476807  1.045772  0.291544
3 2013-01-04 -0.231352 -0.201520  0.720959  0.916076
4 2013-01-05  0.315610  0.696807  0.586792  1.253378
5 2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1041]:
# agregacja na df

In [1042]:
df

                   A         B         C         D
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-05  0.315610  0.696807  0.586792  1.253378
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1043]:
df.sum()

A    4.165324
B   -0.305423
C    2.294568
D    0.059507
dtype: float64

In [1044]:
df.min()

A   -0.367903
B   -1.603251
C   -0.387673
D   -1.446385
dtype: float64

In [1045]:
df.mean()

A    0.694221
B   -0.050904
C    0.382428
D    0.009918
dtype: float64

In [1046]:
df['A'] # prawdzamy kolumne A, or df[['A']] or df.A

2013-01-01    2.686980
2013-01-02    1.781268
2013-01-03   -0.019280
2013-01-04   -0.231352
2013-01-05    0.315610
2013-01-06   -0.367903
Freq: D, Name: A, dtype: float64

In [1047]:
df[['A', 'B']] # prawdzamy kilka kolumn, poprzez podanie listy

                   A         B
2013-01-01  2.686980  0.620658
2013-01-02  1.781268 -1.603251
2013-01-03 -0.019280  0.476807
2013-01-04 -0.231352 -0.201520
2013-01-05  0.315610  0.696807
2013-01-06 -0.367903 -0.294924

In [1048]:
df[['A', 'B']].sum()

A    4.165324
B   -0.305423
dtype: float64

In [1049]:
df['A'][0] # pierwsza wartosc z kolumny A

2.6869802042332527

In [1050]:
df

                   A         B         C         D
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-05  0.315610  0.696807  0.586792  1.253378
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1051]:
df[0:3] # wyswietla 3 pierwsze wiersze

                   A         B         C         D
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544

In [1052]:
df['20130101':'20130103']

                   A         B         C         D
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544

In [1053]:
# Label vs. Location
# The main distinction between the two methods is:

# loc gets rows (and/or columns) with particular labels. label = 20130101

# iloc gets rows (and/or columns) at integer locations.

In [1054]:
b = pd.Series(np.round(np.random.uniform(0,1,10),2))
i = np.r_[0:10]
np.random.shuffle(i)
b.index = i
b

0    0.37
6    0.89
4    0.87
7    0.01
9    0.04
2    0.13
3    0.04
8    0.86
5    0.88
1    0.53
dtype: float64

In [1055]:
b.iloc[2] # 3 numer wiersza, leci od 0

0.87

In [1056]:
b.loc[2] # wartosc z labelem "2"

0.13

In [1057]:
b.loc[0:2] # od labela 0 do 2

0    0.37
6    0.89
4    0.87
7    0.01
9    0.04
2    0.13
dtype: float64

In [1058]:
b.iloc[0:2] #od pozycji 0 do 1 po indexie

0    0.37
6    0.89
dtype: float64

In [1059]:
df

                   A         B         C         D
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-05  0.315610  0.696807  0.586792  1.253378
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1060]:
# df.loc[2:4] nie uda się, bo labele to daty

In [1061]:
df.iloc[2:4]

                   A         B         C         D
2013-01-03 -0.019280  0.476807  1.045772  0.291544
2013-01-04 -0.231352 -0.201520  0.720959  0.916076

In [1062]:
df.loc[dates[0]:dates[2]] # w locu nie ma wykluczania ostatniej wartości

                   A         B         C         D
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544

In [1063]:
df.loc[dates[1]:dates[0]] # nic nie wyświetli bo po dates[1] nie napotka dates[0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [1064]:
df[0:3]

                   A         B         C         D
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544

In [1065]:
# zmiana kierunku
df[3:0:-1]

                   A         B         C         D
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-03 -0.019280  0.476807  1.045772  0.291544
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385

In [1066]:
df[-3:] # od 3 od końca, do końca

                   A         B         C         D
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-05  0.315610  0.696807  0.586792  1.253378
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1067]:
# zakres wierszowo-kolumnowy

In [1068]:
dates[0]

Timestamp('2013-01-01 00:00:00', freq='D')

In [1069]:
df.loc[dates[0],'A'] # wksazanie indexowe po labelu, wartosc krzyzow

2.6869802042332527

In [1070]:
df.at[dates[0],'A']

2.6869802042332527

In [1071]:
df.loc[dates[0],'A':'B']

A    2.686980
B    0.620658
Name: 2013-01-01 00:00:00, dtype: float64

In [1072]:
df.loc[dates[0],['A','B']]

A    2.686980
B    0.620658
Name: 2013-01-01 00:00:00, dtype: float64

In [1073]:
df.loc[dates[0]:dates[2],['A','B']] # wiersz, [kolumna}]

                   A         B
2013-01-01  2.686980  0.620658
2013-01-02  1.781268 -1.603251
2013-01-03 -0.019280  0.476807

In [1074]:
df[df.A<0] # wyselekcjonowane dane

                   A         B         C         D
2013-01-03 -0.019280  0.476807  1.045772  0.291544
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1075]:
df[df.A<0].sum()

A   -0.618535
B   -0.019638
C    1.529369
D    1.048935
dtype: float64

In [1076]:
df[(df.A<0) & (df.B>0)] # A mniejsze od zera i B większe od zera

                  A         B         C         D
2013-01-03 -0.01928  0.476807  1.045772  0.291544

In [1077]:
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-05  0.315610  0.696807  0.586792  1.253378
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1078]:
df2.columns = ['E', 'F', 'G', "H"]
df2

                   E         F         G         H
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-05  0.315610  0.696807  0.586792  1.253378
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1079]:
df2=df2.rename(columns = {'E': 'I'})
df2

                   I         F         G         H
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-05  0.315610  0.696807  0.586792  1.253378
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1080]:
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01  2.686980  0.620658  0.566080 -0.796421
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385
2013-01-03 -0.019280  0.476807  1.045772  0.291544
2013-01-04 -0.231352 -0.201520  0.720959  0.916076
2013-01-05  0.315610  0.696807  0.586792  1.253378
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685

In [1081]:
df2['E'] = ['one', 'one', 'two', 'three', "34", np.nan]
df2

                   A         B         C         D      E
2013-01-01  2.686980  0.620658  0.566080 -0.796421    one
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385    one
2013-01-03 -0.019280  0.476807  1.045772  0.291544    two
2013-01-04 -0.231352 -0.201520  0.720959  0.916076  three
2013-01-05  0.315610  0.696807  0.586792  1.253378     34
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685    NaN

In [1082]:
df2[df2['E'].isin(['one', 'two'])]

                   A         B         C         D    E
2013-01-01  2.686980  0.620658  0.566080 -0.796421  one
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385  one
2013-01-03 -0.019280  0.476807  1.045772  0.291544  two

In [1083]:
df2[df2.E.str.contains('ree',regex=True, na =False)]

                   A        B         C         D      E
2013-01-04 -0.231352 -0.20152  0.720959  0.916076  three

In [1084]:
df2[df2.E.str.contains('ree',regex=True, na =True)]

                   A         B         C         D      E
2013-01-04 -0.231352 -0.201520  0.720959  0.916076  three
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685    NaN

In [1085]:
df2[df2.E.str.contains('\d',regex=True, na=False)] # w True regex \d = jakas cyfra

                  A         B         C         D   E
2013-01-05  0.31561  0.696807  0.586792  1.253378  34

In [1086]:
df2[df2.E.str.contains('\D',regex=False, na =False)] # w False regex \d = \d string

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [1087]:
df2[df2.E.str.contains('\d',regex=True, na=True)]

                   A         B         C         D    E
2013-01-05  0.315610  0.696807  0.586792  1.253378   34
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685  NaN

In [1088]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [1089]:
df2['F'] = s1
df2

                   A         B         C         D      E    F
2013-01-01  2.686980  0.620658  0.566080 -0.796421    one  NaN
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385    one  1.0
2013-01-03 -0.019280  0.476807  1.045772  0.291544    two  2.0
2013-01-04 -0.231352 -0.201520  0.720959  0.916076  three  3.0
2013-01-05  0.315610  0.696807  0.586792  1.253378     34  4.0
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685    NaN  5.0

In [1090]:
df2['F'] = 5
df2

                   A         B         C         D      E  F
2013-01-01  2.686980  0.620658  0.566080 -0.796421    one  5
2013-01-02  1.781268 -1.603251 -0.387673 -1.446385    one  5
2013-01-03 -0.019280  0.476807  1.045772  0.291544    two  5
2013-01-04 -0.231352 -0.201520  0.720959  0.916076  three  5
2013-01-05  0.315610  0.696807  0.586792  1.253378     34  5
2013-01-06 -0.367903 -0.294924 -0.237361 -0.158685    NaN  5

In [1091]:
df = pd.DataFrame(np.random.randn(6,4),
                 index=dates,
                 columns =list('ABCD'))
df['D'] = -5
df['E'] = [np.nan, -1,-2,-3,-4,-5]
df['F'] = [1,2,np.nan,np.nan,np.nan,np.nan]
df

                   A         B         C  D    E    F
2013-01-01  0.951072 -1.375628 -0.026954 -5  NaN  1.0
2013-01-02 -0.402485  0.082131 -0.246336 -5 -1.0  2.0
2013-01-03 -1.750698  0.342819  1.238192 -5 -2.0  NaN
2013-01-04  0.551771 -0.382915 -0.714890 -5 -3.0  NaN
2013-01-05  0.388377  1.190613  1.296023 -5 -4.0  NaN
2013-01-06 -1.937858  1.893546 -1.763650 -5 -5.0  NaN

In [1092]:
pd.isna(df) #sprawdzenie gdzię są NaN

                A      B      C      D      E      F
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True
2013-01-05  False  False  False  False  False   True
2013-01-06  False  False  False  False  False   True

In [1093]:
df.isna().any(axis=1) # any = gdziekolwiek axis = 1 po wierszu

2013-01-01     True
2013-01-02    False
2013-01-03     True
2013-01-04     True
2013-01-05     True
2013-01-06     True
Freq: D, dtype: bool

In [1094]:
df.isna().any(axis=0) # any = gdziekolwiek axis = 0 po kolumnie

A    False
B    False
C    False
D    False
E     True
F     True
dtype: bool

In [1095]:
df[df.isna().any(axis=1)] # nie wyswietla 2013-01-02, bo nie ma Nan

                   A         B         C  D    E    F
2013-01-01  0.951072 -1.375628 -0.026954 -5  NaN  1.0
2013-01-03 -1.750698  0.342819  1.238192 -5 -2.0  NaN
2013-01-04  0.551771 -0.382915 -0.714890 -5 -3.0  NaN
2013-01-05  0.388377  1.190613  1.296023 -5 -4.0  NaN
2013-01-06 -1.937858  1.893546 -1.763650 -5 -5.0  NaN

In [1096]:
df.dropna() # pokazuje gdzie nie ma Nan w jakielkowiek kolumnie( w całym wierszu), 
# "any" - defaultowo

                   A         B         C  D    E    F
2013-01-02 -0.402485  0.082131 -0.246336 -5 -1.0  2.0

In [1097]:
df.dropna(how='all') # pokazuje when ALL values are NULL in row

                   A         B         C  D    E    F
2013-01-01  0.951072 -1.375628 -0.026954 -5  NaN  1.0
2013-01-02 -0.402485  0.082131 -0.246336 -5 -1.0  2.0
2013-01-03 -1.750698  0.342819  1.238192 -5 -2.0  NaN
2013-01-04  0.551771 -0.382915 -0.714890 -5 -3.0  NaN
2013-01-05  0.388377  1.190613  1.296023 -5 -4.0  NaN
2013-01-06 -1.937858  1.893546 -1.763650 -5 -5.0  NaN

In [1098]:
df.fillna(5) # wszyskie Nan wypełnione 5

                   A         B         C  D    E    F
2013-01-01  0.951072 -1.375628 -0.026954 -5  5.0  1.0
2013-01-02 -0.402485  0.082131 -0.246336 -5 -1.0  2.0
2013-01-03 -1.750698  0.342819  1.238192 -5 -2.0  5.0
2013-01-04  0.551771 -0.382915 -0.714890 -5 -3.0  5.0
2013-01-05  0.388377  1.190613  1.296023 -5 -4.0  5.0
2013-01-06 -1.937858  1.893546 -1.763650 -5 -5.0  5.0

In [1099]:
df.fillna(method ='ffill') # wypelnia poprzednia wartością

                   A         B         C  D    E    F
2013-01-01  0.951072 -1.375628 -0.026954 -5  NaN  1.0
2013-01-02 -0.402485  0.082131 -0.246336 -5 -1.0  2.0
2013-01-03 -1.750698  0.342819  1.238192 -5 -2.0  2.0
2013-01-04  0.551771 -0.382915 -0.714890 -5 -3.0  2.0
2013-01-05  0.388377  1.190613  1.296023 -5 -4.0  2.0
2013-01-06 -1.937858  1.893546 -1.763650 -5 -5.0  2.0

In [1100]:
df.fillna(method ='bfill') # wypelnia następną dostępną wartością

                   A         B         C  D    E    F
2013-01-01  0.951072 -1.375628 -0.026954 -5 -1.0  1.0
2013-01-02 -0.402485  0.082131 -0.246336 -5 -1.0  2.0
2013-01-03 -1.750698  0.342819  1.238192 -5 -2.0  NaN
2013-01-04  0.551771 -0.382915 -0.714890 -5 -3.0  NaN
2013-01-05  0.388377  1.190613  1.296023 -5 -4.0  NaN
2013-01-06 -1.937858  1.893546 -1.763650 -5 -5.0  NaN

In [1101]:
# df = pd.DataFrame({'Dzień' : [1,2,3,4,5,6,7],
#                    'Sprzedaż' : [100,150,300,np.nan,0,200,400],
#                    'Cena' : [2.3,2.2,1.99,2.4,np.nan,2.1,2.1],
#                    'Dzień_wolny' : [0,0,0,0,1,0,0,],
#                    'Mecz' : [0,0,0,1,0,0,0]
#                   }) 
# df

In [1102]:
values = [40, 38, 32.5, 27, 33, 34]
 
df['new_col'] = values

In [1103]:
s1 = pd.Series([40.5, 38.5, 33, 28, 26, 25], 
               index=[0, 1, 2, 3, 4, 5])

s2 = pd.Series([48.5, 42, 41, 37, 40, 39], 
               index=[0, 1, 2, 3, 4, 5])
 
df = df.assign(science_score=s1.values, english_score=s2.values)
df

,A,B,C,D,E,F,new_col,science_score,english_score
2013-01-01,0.951072,-1.375628,-0.026954,-5,NaN,1.0,40.0,40.5,48.5
2013-01-02,-0.402485,0.082131,-0.246336,-5,-1.0,2.0,38.0,38.5,42.0
2013-01-03,-1.750698,0.342819,1.238192,-5,-2.0,NaN,32.5,33.0,41.0
2013-01-04,0.551771,-0.382915,-0.714890,-5,-3.0,NaN,27.0,28.0,37.0
2013-01-05,0.388377,1.190613,1.296023,-5,-4.0,NaN,33.0,26.0,40.0
2013-01-06,-1.937858,1.893546,-1.763650,-5,-5.0,NaN,34.0,25.0,39.0

In [1104]:
df['avg_score'] = df.apply(lambda row: 
                               ((row.new_col + row.science_score) / 2), 
                               axis=1)
df

,A,B,C,D,E,F,new_col,science_score,english_score,avg_score
2013-01-01,0.951072,-1.375628,-0.026954,-5,NaN,1.0,40.0,40.5,48.5,40.25
2013-01-02,-0.402485,0.082131,-0.246336,-5,-1.0,2.0,38.0,38.5,42.0,38.25
2013-01-03,-1.750698,0.342819,1.238192,-5,-2.0,NaN,32.5,33.0,41.0,32.75
2013-01-04,0.551771,-0.382915,-0.714890,-5,-3.0,NaN,27.0,28.0,37.0,27.50
2013-01-05,0.388377,1.190613,1.296023,-5,-4.0,NaN,33.0,26.0,40.0,29.50
2013-01-06,-1.937858,1.893546,-1.763650,-5,-5.0,NaN,34.0,25.0,39.0,29.50

In [1111]:
df.drop(['A'], axis=1) # usuwa kolumne 'A'

,B,C,D,E,F,new_col,science_score,english_score,avg_score
2013-01-01,-1.375628,-0.026954,-5,NaN,1.0,40.0,40.5,48.5,40.25
2013-01-02,0.082131,-0.246336,-5,-1.0,2.0,38.0,38.5,42.0,38.25
2013-01-03,0.342819,1.238192,-5,-2.0,NaN,32.5,33.0,41.0,32.75
2013-01-04,-0.382915,-0.714890,-5,-3.0,NaN,27.0,28.0,37.0,27.50
2013-01-05,1.190613,1.296023,-5,-4.0,NaN,33.0,26.0,40.0,29.50
2013-01-06,1.893546,-1.763650,-5,-5.0,NaN,34.0,25.0,39.0,29.50

In [1112]:
df.drop(['2013-01-01','2013-01-02'], axis=0)

,A,B,C,D,E,F,new_col,science_score,english_score,avg_score
2013-01-03,-1.750698,0.342819,1.238192,-5,-2.0,NaN,32.5,33.0,41.0,32.75
2013-01-04,0.551771,-0.382915,-0.714890,-5,-3.0,NaN,27.0,28.0,37.0,27.50
2013-01-05,0.388377,1.190613,1.296023,-5,-4.0,NaN,33.0,26.0,40.0,29.50
2013-01-06,-1.937858,1.893546,-1.763650,-5,-5.0,NaN,34.0,25.0,39.0,29.50

In [1113]:
# wyżucanie po indexie
df.drop(df.loc['2013-01-02':'2013-01-05'].index)

,A,B,C,D,E,F,new_col,science_score,english_score,avg_score
2013-01-01,0.951072,-1.375628,-0.026954,-5,NaN,1.0,40.0,40.5,48.5,40.25
2013-01-06,-1.937858,1.893546,-1.763650,-5,-5.0,NaN,34.0,25.0,39.0,29.50

In [1114]:
df2=df.reset_index()
df2

,index,A,B,C,D,E,F,new_col,science_score,english_score,avg_score
0,2013-01-01,0.951072,-1.375628,-0.026954,-5,NaN,1.0,40.0,40.5,48.5,40.25
1,2013-01-02,-0.402485,0.082131,-0.246336,-5,-1.0,2.0,38.0,38.5,42.0,38.25
2,2013-01-03,-1.750698,0.342819,1.238192,-5,-2.0,NaN,32.5,33.0,41.0,32.75
3,2013-01-04,0.551771,-0.382915,-0.714890,-5,-3.0,NaN,27.0,28.0,37.0,27.50
4,2013-01-05,0.388377,1.190613,1.296023,-5,-4.0,NaN,33.0,26.0,40.0,29.50
5,2013-01-06,-1.937858,1.893546,-1.763650,-5,-5.0,NaN,34.0,25.0,39.0,29.50

In [1116]:
df2[(df2['index']>'2013-01-02') &(df2['index']<'2013-01-04')]

,index,A,B,C,D,E,F,new_col,science_score,english_score,avg_score
2,2013-01-03,-1.750698,0.342819,1.238192,-5,-2.0,NaN,32.5,33.0,41.0,32.75

In [1117]:
df_groupby = pd.DataFrame(np.random.randn(10, 4))

In [1118]:
# łączenie i grupowanie
df_groupby

          0         1         2         3
0 -0.872065 -0.126579  1.882798 -0.087141
1 -1.331283 -0.829787  1.145245  1.193201
2  0.594406  0.038604  0.459038  1.016351
3  0.286301  3.053721  0.242944  0.153104
4  0.316799  2.223852 -0.873440 -1.886522
5 -0.169857 -0.093063 -0.261737 -0.587110
6  0.188681 -0.744585  2.300025 -0.078163
7  0.419011 -0.922970 -0.784983 -0.979689
8  0.936528  0.981305 -0.313161  1.726778
9  0.968349 -0.767991 -1.247064  0.406504

In [1119]:
df_groupby[:3]

          0         1         2         3
0 -0.872065 -0.126579  1.882798 -0.087141
1 -1.331283 -0.829787  1.145245  1.193201
2  0.594406  0.038604  0.459038  1.016351

In [1120]:
df_groupby[3:6]

          0         1         2         3
3  0.286301  3.053721  0.242944  0.153104
4  0.316799  2.223852 -0.873440 -1.886522
5 -0.169857 -0.093063 -0.261737 -0.587110

In [1121]:
pieces = [df_groupby[:3], df_groupby[3:7], df_groupby[7:]]  # podział wg wierszy

In [1122]:
type(pieces)

list

In [1126]:
pieces

[          0         1         2         3
 0 -0.872065 -0.126579  1.882798 -0.087141
 1 -1.331283 -0.829787  1.145245  1.193201
 2  0.594406  0.038604  0.459038  1.016351,
           0         1         2         3
 3  0.286301  3.053721  0.242944  0.153104
 4  0.316799  2.223852 -0.873440 -1.886522
 5 -0.169857 -0.093063 -0.261737 -0.587110
 6  0.188681 -0.744585  2.300025 -0.078163,
           0         1         2         3
 7  0.419011 -0.922970 -0.784983 -0.979689
 8  0.936528  0.981305 -0.313161  1.726778
 9  0.968349 -0.767991 -1.247064  0.406504]

In [1127]:
pd.concat(pieces)

          0         1         2         3
0 -0.872065 -0.126579  1.882798 -0.087141
1 -1.331283 -0.829787  1.145245  1.193201
2  0.594406  0.038604  0.459038  1.016351
3  0.286301  3.053721  0.242944  0.153104
4  0.316799  2.223852 -0.873440 -1.886522
5 -0.169857 -0.093063 -0.261737 -0.587110
6  0.188681 -0.744585  2.300025 -0.078163
7  0.419011 -0.922970 -0.784983 -0.979689
8  0.936528  0.981305 -0.313161  1.726778
9  0.968349 -0.767991 -1.247064  0.406504

In [1130]:
#merge
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [1131]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]}) 
right

   key  rval
0  foo     4
1  foo     5

In [1133]:
merged = pd.merge(left, right, on='key')  # łączenie wg wspólnej kolumny
merged
# domyslnie how = "inner"

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [1136]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'c': ['foo', 'baz'], 'b': [2, 4]})

In [1137]:
df1

     a  b
0  foo  1
1  bar  2

In [1138]:
df2

     c  b
0  foo  2
1  baz  4

In [1139]:
df1.merge(df2, how='left', on='b') #dolacz df2 do df1(jako, ze left, df1 jest wazniejsze) po kluczu z kolumny b

     a  b    c
0  foo  1  NaN
1  bar  2  foo

In [1140]:
df1.merge(df2, how='right', on='b')  #dolacz df1 do df2(jako, ze right) po kluczu z kolumny b

     a  b    c
0  bar  2  foo
1  NaN  4  baz

In [1141]:
df1.merge(df2, how='inner', on='b') # łączy to co jest w obu df

     a  b    c
0  bar  2  foo

In [1142]:
df1.merge(df2, how='outer', on='b') # łączy wszystko

     a  b    c
0  foo  1  NaN
1  bar  2  foo
2  NaN  4  baz

In [1143]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.250279 -1.017874
1  bar    one  0.194329  1.059356
2  foo    two -0.950594  0.130751
3  bar  three  1.102380  0.985458
4  foo    two  0.686446 -0.625655
5  bar    two -1.942265 -1.732113
6  foo    one  0.923479 -0.284494
7  foo  three -0.821839 -2.065417

In [1145]:
df.groupby('A').sum()

C:\Users\AsusF512ua-ej269t\AppData\Local\Temp\ipykernel_16512\1885751491.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('A').sum()

            C         D
A
bar -0.645556  0.312701
foo  0.087771 -3.862688

In [1146]:
df.groupby('A').min()

       B         C         D
A
bar  one -1.942265 -1.732113
foo  one -0.950594 -2.065417

In [1147]:
df.groupby('A').mean()

C:\Users\AsusF512ua-ej269t\AppData\Local\Temp\ipykernel_16512\714605139.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('A').mean()

            C         D
A
bar -0.215185  0.104234
foo  0.017554 -0.772538

In [1148]:
df.groupby('A').std()

C:\Users\AsusF512ua-ej269t\AppData\Local\Temp\ipykernel_16512\3136877984.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('A').std()

            C         D
A
bar  1.563087  1.590752
foo  0.860838  0.837768

In [1149]:
df

     A      B         C         D
0  foo    one  0.250279 -1.017874
1  bar    one  0.194329  1.059356
2  foo    two -0.950594  0.130751
3  bar  three  1.102380  0.985458
4  foo    two  0.686446 -0.625655
5  bar    two -1.942265 -1.732113
6  foo    one  0.923479 -0.284494
7  foo  three -0.821839 -2.065417

In [1150]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.194329  1.059356
    three  1.102380  0.985458
    two   -1.942265 -1.732113
foo one    1.173758 -1.302368
    three -0.821839 -2.065417
    two   -0.264149 -0.494904

In [1151]:
df2 = df.groupby(['A','B']).sum() # multy index

In [1153]:
df2.loc['bar','one']

C    0.194329
D    1.059356
Name: (bar, one), dtype: float64

In [1156]:
df2.reset_index(drop=False)

     A      B         C         D
0  bar    one  0.194329  1.059356
1  bar  three  1.102380  0.985458
2  bar    two -1.942265 -1.732113
3  foo    one  1.173758 -1.302368
4  foo  three -0.821839 -2.065417
5  foo    two -0.264149 -0.494904

In [1159]:
midx = pd.MultiIndex(
    levels=[["zero2", "one"],
            ["x", "y"]], 
    codes=[[1, 1, 0, 0], [1, 0, 1, 0]]
)


df_indeksy = pd.DataFrame(np.random.randn(4, 2), index=midx)
df_indeksy

                0         1
one   y  0.117032  0.270261
      x  0.896854 -1.906231
zero2 y -1.375876 -1.198866
      x -0.658391  0.959522

In [1160]:
df_indeksy[0]

one    y    0.117032
       x    0.896854
zero2  y   -1.375876
       x   -0.658391
Name: 0, dtype: float64

In [1163]:
df_indeksy.loc[:, 1] # wez wszystko z 1wszej kolumny

one    y    0.270261
       x   -1.906231
zero2  y   -1.198866
       x    0.959522
Name: 1, dtype: float64

In [1164]:
df_indeksy.loc['one', 'y']

0    0.117032
1    0.270261
Name: (one, y), dtype: float64

In [1165]:
df_indeksy.columns = ['jeden', 'dwa']
df_indeksy

C:\Users\AsusF512ua-ej269t\AppData\Local\Programs\Python\Python311\Lib\site-packages\IPython\core\displayhook.py:281: UserWarning: Output cache limit (currently 1000 entries) hit.
Flushing oldest 200 entries.
  warn('Output cache limit (currently {sz} entries) hit.\n'

            jeden       dwa
one   y  0.117032  0.270261
      x  0.896854 -1.906231
zero2 y -1.375876 -1.198866
      x -0.658391  0.959522

In [1166]:
df_indeksy.loc['one', 'y']

jeden    0.117032
dwa      0.270261
Name: (one, y), dtype: float64

In [1167]:
df_indeksy.loc[:, 'jeden'] # show all for column 'jeden'

one    y    0.117032
       x    0.896854
zero2  y   -1.375876
       x   -0.658391
Name: jeden, dtype: float64

In [1168]:
df_indeksy.loc[:, ['jeden', 'dwa']]

            jeden       dwa
one   y  0.117032  0.270261
      x  0.896854 -1.906231
zero2 y -1.375876 -1.198866
      x -0.658391  0.959522

In [1172]:
df_indeksy[['jeden', 'dwa']]

            jeden       dwa
one   y  0.117032  0.270261
      x  0.896854 -1.906231
zero2 y -1.375876 -1.198866
      x -0.658391  0.959522